In [112]:
#Data representation basics 2.ipynb
#Data Preparation Basics
#Part 2 - Treating missing values

import numpy as np
import pandas as pd
from pandas import Series, DataFrame

#Tasks 1:
#Create a pandas DataFrame named sales_data with the following data:
missing = np.nan
sales_data = {
  "Date": ["2023-01-01", "2023-01-02", "2023-01-03","2023-01-04","2023-01-03"],
  "Revenue": [1000, 1200, missing, missing,1500]
}

#load data into a DataFrame object:
df = pd.DataFrame(sales_data)

print(df)

         Date  Revenue
0  2023-01-01   1000.0
1  2023-01-02   1200.0
2  2023-01-03      NaN
3  2023-01-04      NaN
4  2023-01-03   1500.0

In [114]:
#Task 2: Fill in the missing values (NaN) in the 'Revenue' column with the value 800.
df['Revenue'] = df['Revenue'].fillna(800)


print(df)

         Date  Revenue
0  2023-01-01   1000.0
1  2023-01-02   1200.0
2  2023-01-03    800.0
3  2023-01-04    800.0
4  2023-01-03   1500.0

In [ ]:
#Data representation basics 3.ipynb

In [ ]:
#Task 1: Create a pandas DataFrame named orders_df with the following data:

In [116]:
orders_df = {
    "Order_id": ["101", "102", "103","104","105"],
    "Customer_id": ["A100", "A101", "A100", "A102","A103"],
    "Product": ["Laptop", "Smartphone", "Laptop", "Tablet", "Smartphone"]
}

#load data into a DataFrame object:
df = pd.DataFrame(orders_df)

print(df)

  Order_id Customer_id     Product
0      101        A100      Laptop
1      102        A101  Smartphone
2      103        A100      Laptop
3      104        A102      Tablet
4      105        A103  Smartphone

In [ ]:
#Part 3 - Removing duplicates
#Task 2:
#Check for duplicate orders based on the combination of 'OrderID' and 'CustomerID' columns and print the result.
#Drop the duplicate orders.

In [118]:
df.drop_duplicates()

  Order_id Customer_id     Product
0      101        A100      Laptop
1      102        A101  Smartphone
2      103        A100      Laptop
3      104        A102      Tablet
4      105        A103  Smartphone

In [120]:
df.drop_duplicates(['Customer_id'])

  Order_id Customer_id     Product
0      101        A100      Laptop
1      102        A101  Smartphone
3      104        A102      Tablet
4      105        A103  Smartphone

In [122]:
df.drop_duplicates(['Product'])

  Order_id Customer_id     Product
0      101        A100      Laptop
1      102        A101  Smartphone
3      104        A102      Tablet

In [ ]:
#Part 4 - Concatenating and transforming data

In [ ]:
#Task 1:
#You are working with two separate datasets containing information about sales orders for a retail company. 
#Your task is to prepare and concatenate the data to create a single DataFrame for analysis.

In [138]:
sales_data_1= pd.DataFrame({
    "Order_id": ["101", "102", "103"],
    "Customer_id": ["A100", "A101", "A100"],
    "Product": ["Laptop", "Smartphone", "Laptop"]
})

#load data into a DataFrame object:
df = pd.DataFrame(sales_data_1)

print(df)

  Order_id Customer_id     Product
0      101        A100      Laptop
1      102        A101  Smartphone
2      103        A100      Laptop

In [140]:
sales_data_2 = pd.DataFrame({
    "Order_id": ["104", "105", "106"],
    "Customer_id": ["A102", "A103", "A101"],
    "Product": ["Monitor", "Keyboard", "Mouse"]
})

#load data into a DataFrame object:
df = pd.DataFrame(sales_data_2)

print(df)

  Order_id Customer_id   Product
0      104        A102   Monitor
1      105        A103  Keyboard
2      106        A101     Mouse

In [142]:
#Your task is to concatenate these two datasets vertically (along rows) to create a single DataFrame named combined_sales_data.

combined_sales = pd.concat([sales_data_1, sales_data_2])

print(combined_sales)

  Order_id Customer_id     Product
0      101        A100      Laptop
1      102        A101  Smartphone
2      103        A100      Laptop
0      104        A102     Monitor
1      105        A103    Keyboard
2      106        A101       Mouse